doc/slides/slide_STL.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>Introduction à la librairie standard</title>
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" href="../stylesheets/styles.css">
                 <link rel="stylesheet" href="../stylesheets/org-pygments.css">
</head>
<body>
<div id="preamble" class="status">
</a><a href="slide_compilation.html">Compilation & Directives de préprocesseur </a><a href="slide_pointeur.html">Pointeurs, Références & Allocation Dynamique de Mémoire </a><a href="slide_specificite_c++.html">Spécificités du C++ (indépendantes de la POO) </a><a href="slide_struct_class.html">Structures & Classes </a><a href="slide_encapsulation.html">Encapsulation des données </a><a href="slide_constructeur.html">Constructeur & Destructeur de classe </a><a href="slide_copie.html">Copie d'objets </a><a href="slide_amitie_surcharge.html">Amitié & Surcharge d'opérateur </a><a href="slide_heritage_1.html">Héritage (Partie 1) </a><a href="slide_heritage_2.html">Héritage (Partie 2) </a><a href="slide_template.html">Patrons de fonctions et de classes </a><a href="slide_STL.html">Introduction à la librairie standard </a>
                     <hr/>
                     <a href="../../index.html">Retour menu principal</a>
</div>
<div id="content">
<h1 class="title">Introduction à la librairie standard</h1><hr/>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1">La librairie standard STL</h2>
<div class="outline-text-2" id="text-orgheadline1">
<p>
La librairie standard STL (<i>Standard Template Library</i>) du C++ fournit <b>un
ensemble de containers</b> en exploitant très largement les mécanismes étendus du
C++ par rapport au C
</p>

<ul class="org-ul">
<li>l&rsquo;approche objet et les capacités d&rsquo;abstraction en particulier sur les
opérateurs,</li>

<li>la surdéfinition des opérateurs,</li>

<li>les patrons ou templates.</li>
</ul>

<p>
La STL fournit par ailleurs des algorithmes (optimisés) permettant la
manipulation aisée de ces nouveaux containers (initialisation, recherche de
valeurs &#x2026;)
</p>

<div class="org-center">
<p>
<a href="http://www.sgi.com/tech/stl/table_of_contents.html">http://www.sgi.com/tech/stl/table_of_contents.html</a>
</p>
</div>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2">La classe <code>string</code></h2>
<div class="outline-text-2" id="text-orgheadline2">
<p>
En C, une chaîne de caractère se présente sous la forme d&rsquo;un tableau
de caractères
</p>

<div class="org-src-container">

<pre class="src src-c++"><span class="org-type">char</span> * <span class="org-variable-name">name</span> = <span class="org-keyword">new</span> <span class="org-type">char</span>[256];
</pre>
</div>

<p>
La manipulation de ces pointeurs de caractères peut se faire par le biais de
fonctions définies dans <code>string.h</code> (<code>cstring</code> en C++)
</p>

<p>
Le C n&rsquo;utilisant pas la surcharge d&rsquo;opérateurs tels que <code>+=</code> ou <code>+</code>, la
manipulation est globalement complexe (sans parler de la désallocation de
mémoire).
</p>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3">La classe <code>string</code></h2>
<div class="outline-text-2" id="text-orgheadline3">
<p>
Utilisation de la classe <code>string</code> en C++
</p>

<div class="org-src-container">

<pre class="src src-c++"><span class="org-preprocessor">#include</span> <span class="org-string">&lt;string&gt;</span>
<span class="org-type">int</span> <span class="org-function-name">main</span>()
{
  <span class="org-comment-delimiter">// </span><span class="org-comment">Assignation/copie de strings</span>
  <span class="org-constant">std</span>::<span class="org-type">string</span> <span class="org-variable-name">my_string1</span> = <span class="org-string">"abcd"</span>;
  <span class="org-constant">std</span>::<span class="org-type">string</span> <span class="org-variable-name">my_string2</span> = my_string1;

  <span class="org-comment-delimiter">// </span><span class="org-comment">Initialisation de strings</span>
  <span class="org-constant">std</span>::<span class="org-type">string</span> <span class="org-variable-name">my_string3</span>(my_string2);
  ...
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline4" class="outline-2">
<h2 id="orgheadline4">La classe <code>string</code></h2>
<div class="outline-text-2" id="text-orgheadline4">
<div class="org-src-container">

<pre class="src src-c++"><span class="org-comment-delimiter">// </span><span class="org-comment">Concat&#233;nation</span>
my_string2 += <span class="org-string">"abcd"</span>;
<span class="org-constant">std</span>::<span class="org-type">string</span> <span class="org-variable-name">my_string4</span> = my_string1 + <span class="org-string">"toto"</span>;

<span class="org-comment-delimiter">// </span><span class="org-comment">Comparaison</span>
<span class="org-keyword">const</span> <span class="org-type">bool</span> <span class="org-variable-name">are_equal</span> = (my_string1 == my_string2);
<span class="org-keyword">if</span> (are_equal) {
  <span class="org-constant">std</span>::cout &lt;&lt; my_string1 &lt;&lt; <span class="org-string">" est identique &#224; "</span> &lt;&lt; my_string2 &lt;&lt; <span class="org-constant">std</span>::endl;
}

<span class="org-comment-delimiter">// </span><span class="org-comment">Longueur d'une string</span>
<span class="org-type">size_t</span> <span class="org-variable-name">size</span> = my_string1.size();
<span class="org-comment-delimiter">// </span><span class="org-comment">Recherche dans une string</span>
<span class="org-type">size_t</span> <span class="org-variable-name">pos</span> = my_string1.find(<span class="org-string">"bc"</span>);
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline5" class="outline-2">
<h2 id="orgheadline5">La classe <code>vector</code></h2>
<div class="outline-text-2" id="text-orgheadline5">
<ul class="org-ul">
<li>La classe <code>vector</code> est proche par son utilisation du tableau défini en C,</li>

<li>L&rsquo;avantage majeur de la classe <code>vector</code> tient en trois points :

<ol class="org-ol">
<li>l&rsquo;utilisation de la notion de patron lui permet de manipuler n&rsquo;importe quel
type de données,</li>

<li>sa capacité à réallouer automatiquement l&rsquo;espace mémoire nécessaire via la
méthode <code>push_back</code>,</li>

<li>la désallocation de mémoire est automatique grâce à l&rsquo;implémentation d&rsquo;un
destructeur.</li>
</ol></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline6" class="outline-2">
<h2 id="orgheadline6">La classe <code>vector</code></h2>
<div class="outline-text-2" id="text-orgheadline6">
<div class="org-src-container">

<pre class="src src-c++"><span class="org-preprocessor">#include</span> <span class="org-string">&lt;vector&gt;</span>
<span class="org-preprocessor">#include</span> <span class="org-string">&lt;iostream&gt;</span>

<span class="org-type">int</span> <span class="org-function-name">main</span>()
{
  <span class="org-comment-delimiter">// </span><span class="org-comment">D&#233;claration d'un vecteur d'entiers de taille non connue</span>
  <span class="org-constant">std</span>::<span class="org-type">vector</span>&lt;<span class="org-type">int</span>&gt; <span class="org-variable-name">my_vector1</span>;

  <span class="org-comment-delimiter">// </span><span class="org-comment">Ajout de trois elements</span>
  my_vector1.push_back(4);
  my_vector1.push_back(2);
  my_vector1.push_back(5);

  <span class="org-comment-delimiter">// </span><span class="org-comment">La m&#233;thode size pr&#233;cise le nombre d'entr&#233;e courante</span>
  <span class="org-keyword">for</span> (<span class="org-type">size_t</span> <span class="org-variable-name">i</span> = 0; i &lt; my_vector1.size(); ++i)
    <span class="org-constant">std</span>::cout &lt;&lt; i &lt;&lt; <span class="org-string">" "</span> &lt;&lt; my_vector1[i] &lt;&lt; <span class="org-constant">std</span>::endl;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline7" class="outline-2">
<h2 id="orgheadline7">La classe <code>vector</code></h2>
<div class="outline-text-2" id="text-orgheadline7">
<div class="org-src-container">

<pre class="src src-c++"><span class="org-comment-delimiter">// </span><span class="org-comment">Cr&#233;ation d'un vecteur d'entier contenant 70,70,70,70,70</span>
<span class="org-constant">std</span>::<span class="org-type">vector</span>&lt;<span class="org-type">int</span>&gt; <span class="org-function-name">my_vector2</span>(5, 70);

<span class="org-comment-delimiter">// </span><span class="org-comment">R&#233;assignation des valeurs de ce vecteur</span>
my_vector2[0] = 5;
my_vector2[1] = 3;
my_vector2[2] = 7;
my_vector2[3] = 4;
my_vector2[4] = 8;

<span class="org-comment-delimiter">// </span><span class="org-comment">Nettoyage de l'espace m&#233;moire</span>
my_vector2.clear();
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline8" class="outline-2">
<h2 id="orgheadline8">La classe <code>vector</code></h2>
<div class="outline-text-2" id="text-orgheadline8">
<div class="org-src-container">

<pre class="src src-c++"><span class="org-comment-delimiter">// </span><span class="org-comment">Cr&#233;ation d'un vecteur de particule</span>
<span class="org-constant">std</span>::<span class="org-type">vector</span>&lt;particule&gt; <span class="org-variable-name">my_particles</span>;

<span class="org-comment-delimiter">// </span><span class="org-comment">Cr&#233;ation d'un ensemble de particule</span>
<span class="org-keyword">for</span> (<span class="org-type">size_t</span> <span class="org-variable-name">i</span> = 0; i &lt; 10; ++i) {
  <span class="org-type">particule</span> <span class="org-variable-name">my_particle</span>(0.511*i, -1.6e-19*i);
  my_particles.push_back(my_particle);

  <span class="org-comment-delimiter">// </span><span class="org-comment">Affiche la derni&#232;re particule</span>
  my_particles.back().affiche();
}
</pre>
</div>
</div>
</div>
</div>
</body>
</html>
